export function Docs() {
    return (
            <p className="mx-[1vw]">Что такое Electron?<br/>
            Electron - это фреймворк для разработки десктопных приложений 
            с использованием HTML, CSS и JavaScript. 
            <br/><br/>В двоичный код Electron уже встроены Chromium и Node.js, 
            и это позволяет вам поддерживать только JavaScript код 
            и создавать кроссплатформенные приложение, которые будут 
            работать как на Windows, так и на macOS и Linux 
            без необходимости иметь собственный опыт разработки.
            <br/><br/>Начало работы
            <br/><br/>Мы рекомендуем вам начать с руководства, которое пошагово 
            познакомит вас с процессом разработки и последующего 
            распространения приложения Electron. Примеры и документацию 
            API также можно использовать для поиска и изучения новых 
            для вас вещей.
            <br/><br/>Эксперименты с Electron Fiddle
            <br/><br/>Electron Fiddle - песочница, написанная на Electron и 
            поддерживаемая разработчиками Electron. Мы настоятельно 
            рекомендуем установить его в качестве обучающего инструмента 
            для экспериментов с API-интерфейсами Electron или для 
            создания прототипов функций во время разработки.
            <br/><br/>Fiddle также прекрасно интегрируется с нашей документацией. 
            При просмотре примеров в наших учебниках вы часто видите 
            кнопку "Открыть в Electron Fiddle" под блоком кода. Если 
            у вас установлен Fiddle эта кнопка откроет  fiddle.electronjs. 
            rg ссылка, которая автоматически загрузит пример в Fiddle, 
            не требуется. fiddle docs/latest/fiddles/quick-start
            <br/><br/>Что есть в документации?
            <br/><br/>Вся официальная документация доступна на боковой панели. 
            Ниже перечислены различные категории и то, что вы можете 
            ожидать в каждой из них:
            <br/><br/>Руководство: Комплексное пособие по созданию и публикации 
            вашего первого приложения Electron.
            <br/><br/>Процессы в Electron: Подробная информация о процессах 
            Electron и о том, как с ними работать.
            <br/><br/>Рекомендации: Важные правила, о которых следует помнить 
            при разработке приложения Electron.
            <br/><br/>Примеры: Краткие руководства по добавлению функций в ваше 
            приложение Electron.
            <br/><br/>Разработка: Различные руководства по разработке.
            <br/><br/>Распространение: Узнайте, как распространять ваше 
            приложение конечным пользователям.
            <br/><br/>Тестирование и отладка: Как отлаживать JavaScript, писать 
            тесты, а также различные инструменты для создания качественных 
            приложений Electron.
            <br/><br/>References: Useful links to better understand how the 
            Electron project works and is organized.
            <br/><br/>Вклад в проект: Компиляция Electron и участие в разработке 
            могут казаться сложными. В этом разделе мы постараемся 
            облегчить эту задачу.</p>
    )
   
}
